import java.util.Scanner;

public class Task6 {
    public static void main(String[] args) {
        System.out.println("Конвертер физических величин");
        System.out.println("Выберите, что переводить: \n 1 - масса \n 2 - расстояние");
        Scanner console = new Scanner(System.in);
        int x = console.nextInt();
        if (x==1) System.out.println("Выберите единицу измерения: \n 1 - грамм \n 2 - фунт \n 3 - стоун \n 4 - унция");
        else if (x==2) System.out.println("Выберите единицу измерения: \n 1 - метр \n 2 - миля \n 3 - ярд \n 4 - фут");
        int y = console.nextInt();
        System.out.println("Введите число (количество выбранных Вами единиц): ");
        int z = console.nextInt();
        if ((x==1)&&(y==1)){
            System.out.println("Результат: \n" + " Граммы: " + z + "\n" + " Фунты: " + (0.0022*z) + "\n" + " Стоуны: " + (0.000157*z) + "\n" + " Унции: " + (0.035*z));
        }
        else if ((x==1)&&(y==2)){
            System.out.println("Результат: \n" + " Фунты: " + z + "\n" + " Граммы: " + (453.59*z) + "\n" + " Стоуны: " + (0.071429*z) + "\n" + " Унции: " + (16*z));

        }
        else if ((x==1)&&(y==3)){
            System.out.println("Результат: \n" + " Стоуны: " + z + "\n" + " Фунты: " + (14*z) + "\n" + " Граммы: " + (6350.295*z) + "\n" + " Унции: " + (204.166746*z));

        }
        else if ((x==1)&&(y==4)){

            System.out.println("Результат: \n" + " Унции: " + z + "\n" + " Фунты: " + (0.063*z) + "\n" + " Стоуны: " + ( 0.004898*z) + "\n" + " Граммы: " + (28.35*z));
        }
        else if ((x==2)&&(y==1)){
            System.out.println("Результат: \n" + " Метры: " + z + "\n" + " Мили: " + (0.00062*z) + "\n" + " Ярды: " + (1.09*z) + "\n" + " Футы: " + (3.28*z));
        }
        else if ((x==2)&&(y==2)){
            System.out.println("Результат: \n" + " Мили: " + z +"\n" + " Метры: " + (1609.34*z) + "\n" + " Ярды: " + (1760*z) + "\n" + " Футы: " + (5280*z));
        }
        else if ((x==2)&&(y==3)){
            System.out.println("Результат: \n" + " Ярды: " + z +"\n" + " Метры: " + (0.91*z) + "\n" + " Мили: "  + (0.00057*z) + "\n" + " Футы: " + (3*z));
        }
        else if ((x==2)&&(y==4)){
            System.out.println("Результат: \n" + " Футы: " + z +"\n" + " Метры: " + (0.3*z) + "\n" + " Мили: "  + (0.00019*z) + "\n" + " Ярды: " + (0.33*z));
        }





    }
}
